# ObjSurfAreaInWorldC

## Description
Function ObjSurfAreaInWorldC calculates the surface area of the referenced solid object. The function supports only valid solids objects.

```pascal
FUNCTION ObjSurfAreaInWorldC(solidObject : HANDLE): REAL;
```

```python
def vs.ObjSurfAreaInWorldC(solidObject):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|solidObject|HANDLE|Handle to solids object.|

## Remarks
Calculates the surface area the given object if a valid solid.

## Examples
```pascal
PROCEDURE Example;
VAR
        volume, area: REAL;
BEGIN
        IF FSActLayer <> NIL THEN BEGIN
                volume := CalcVolume(FSActLayer);
                area := ObjSurfaceAreaInWorldCoord(FSActLayer);
                Message('Volume ', volume, ', surface area ', area);
        END;
END;
RUN(Example);
```

```pascal
resultVal := ObjSurfAreaInWorldC(solidObject);
```
```python
import vs

# Function ObjSurfAreaInWorldC calculates the surface area of the referenced
# solid object.
solidObject = vs.FSActLayer()  # handle to the first selected object on the active layer

area = vs.ObjSurfAreaInWorldC(solidObject)
vs.Message('ObjSurfAreaInWorldC returned: ' + str(area))
```

## Version
Availability: from Vectorworks 2023.3

## Category
* Objects - Solids